# Leyendo datos

## 1. Leyendo archivos planos (.csv)

### a. Lo más básico

In [1]:
import pandas as pd

In [2]:
pd.read_csv('cursos02.csv')

   course_id                  course_name    instructor
0        101              Intro to Python   Bruce Wayne
1        102                 Intro to SQL       Ironman
2        201    Exploratory Data Analysis      John Doe
3        301                   Algorithms  Peter Parker
4        331  Natural Language Processing      Dua Lipa

### b. Cambiar la ruta del archivo

In [3]:
# Mismo folder
pd.read_csv('cursos02.csv')

   course_id                  course_name    instructor
0        101              Intro to Python   Bruce Wayne
1        102                 Intro to SQL       Ironman
2        201    Exploratory Data Analysis      John Doe
3        301                   Algorithms  Peter Parker
4        331  Natural Language Processing      Dua Lipa

In [4]:
# Otro folder
pd.read_csv('data/cursos.csv')

   course_id                  course_name    instructor
0        101              Intro to Python   Bruce Wayne
1        102                 Intro to SQL       Ironman
2        201    Exploratory Data Analysis      John Doe
3        301                   Algorithms  Peter Parker
4        331  Natural Language Processing      Dua Lipa

### c. Argumentos (parámetros)

In [5]:
# parámetro header
pd.read_csv('data/cursos.csv', header = None)

           0                            1             2
0  course_id                  course_name    instructor
1        101              Intro to Python   Bruce Wayne
2        102                 Intro to SQL       Ironman
3        201    Exploratory Data Analysis      John Doe
4        301                   Algorithms  Peter Parker
5        331  Natural Language Processing      Dua Lipa

In [6]:
# parámetro separador
pd.read_csv('data/cursos.csv', sep = '|')

           course_id,course_name,instructor
0           101,Intro to Python,Bruce Wayne
1                  102,Intro to SQL,Ironman
2    201,Exploratory Data Analysis,John Doe
3               301,Algorithms,Peter Parker
4  331,Natural Language Processing,Dua Lipa

## 2. Leyendo archivos de Excel

In [7]:
# Formato básico
pd.read_excel('data/CourseOfferings.xlsx')

     Instructor                    Title
0  Chris Bruehl   Lead Python Instructor
1   John Pauler     Chief Growth Officer
2    Alice Zhao  Data Science Instructor

In [8]:
# Sheet name
pd.read_excel('data/CourseOfferings.xlsx', sheet_name = 0)

     Instructor                    Title
0  Chris Bruehl   Lead Python Instructor
1   John Pauler     Chief Growth Officer
2    Alice Zhao  Data Science Instructor

## 3. Conectando base de datos SQL

In [ ]:
# SQLite database

import sqlite3
conn = sqlite3.connect('data/database.db')

pd.read_sql('SELECT * FROM courses', conn)

In [ ]:
# Otro ejemplo de consulta SQL
pd.read_sql('SELECT * FROM courses WHERE course_id LIKE "1%"', conn)

In [ ]:
# Para MySQL, PostgreSQL, también es posible
# Oracle and SQL Server is more involved

# 1. (pip install or conda install)
!pip install mysql-connector-python

# 2. Conexión a la base de datos
import mysql.connector
conn = mysql.connector.connect(host='localhost',
                               database='my_new_db',
                               user='alice',
                               password='password')

# 3. SQL en python
pd.read_sql('SELECT * FROM courses', conn)

## 4. Explorar un DataFrame

In [9]:
# Guardar la lectura en un objeto

df = pd.read_csv('data/cursos.csv')
df

   course_id                  course_name    instructor
0        101              Intro to Python   Bruce Wayne
1        102                 Intro to SQL       Ironman
2        201    Exploratory Data Analysis      John Doe
3        301                   Algorithms  Peter Parker
4        331  Natural Language Processing      Dua Lipa

In [10]:
df.head(3)

   course_id                course_name   instructor
0        101            Intro to Python  Bruce Wayne
1        102               Intro to SQL      Ironman
2        201  Exploratory Data Analysis     John Doe

In [11]:
df.shape

(5, 3)

In [12]:
df.count()

course_id      5
course_name    5
instructor     5
dtype: int64

In [13]:
df.describe()

        course_id
count    5.000000
mean   207.200000
std    107.829495
min    101.000000
25%    102.000000
50%    201.000000
75%    301.000000
max    331.000000

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   course_id    5 non-null      int64
 1   course_name  5 non-null      object
 2   instructor   5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes